#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_group.service_accounts will be created
  + resource "okta_group" "service_accounts" {
      + description = "Group for all service accounts"
      + id          = (known after apply)
      + name        = "Service Accounts"
      + skip_users  = false
    }

  # okta_group_memberships.api_service_membership will be created
  + resource "okta_group_memberships" "api_service_membership" {
      + group_id        = (known after apply)
      + id              = (known after apply)
      + track_all_users = false
      + users           = (known after apply)
    }

  # okta_group_memberships.data_sync_service_membership will be created
  + resource "okta_group_memberships" "data_sync_service_membership" {
      + group_id        = (known after apply)
      + id              = (known after apply)
      + track_all_users = false
      + users           = (known after apply)
    }

  # okta_group_memberships.monitoring_service_membership will be created
  + resource "okta_group_memberships" "monitoring_service_membership" {
      + group_id        = (known after apply)
      + id              = (known after apply)
      + track_all_users = false
      + users           = (known after apply)
    }

  # okta_user.api_service_account will be created
  + resource "okta_user" "api_service_account" {
      + custom_profile_attributes = (known after apply)
      + email                     = "api-service@demo-nt-oig-owi.com"
      + expire_password_on_create = false
      + first_name                = "API"
      + id                        = (known after apply)
      + last_name                 = "Service Account"
      + login                     = "api-service@demo-nt-oig-owi.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

  # okta_user.data_sync_service_account will be created
  + resource "okta_user" "data_sync_service_account" {
      + custom_profile_attributes = (known after apply)
      + email                     = "data-sync-service@demo-nt-oig-owi.com"
      + expire_password_on_create = false
      + first_name                = "DataSync"
      + id                        = (known after apply)
      + last_name                 = "Service Account"
      + login                     = "data-sync-service@demo-nt-oig-owi.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

  # okta_user.monitoring_service_account will be created
  + resource "okta_user" "monitoring_service_account" {
      + custom_profile_attributes = (known after apply)
      + email                     = "monitoring-service@demo-nt-oig-owi.com"
      + expire_password_on_create = false
      + first_name                = "Monitoring"
      + id                        = (known after apply)
      + last_name                 = "Service Account"
      + login                     = "monitoring-service@demo-nt-oig-owi.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_account_ids       = {
      + api_service = (known after apply)
      + data_sync   = (known after apply)
      + monitoring  = (known after apply)
    }
  + service_accounts_group_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @joevanhorn, Action: `pull_request`*